#include "DialogueNPCData.h"

DialogueNPCData professorNpc = {
    L"어두운 강의실 안",
    L"수상한 교수님",
    L"교수 제갈현철",
    L"덕래관 4층",
    {
        L"      ###############      ",
        L"    /########  ##  ###     ",
        L"   /#                #＼   ",
        L"  /#                 ##＼  ",
        L"  ##   ===       ===  ###  ",
        L" ###    ■         ■   ##|  ",
        L"  ＼|       __       |/)   ",
        L"    |    /\\__/\\     |     ",
        L"     |  {______}   /      ",
        L"      ＼   --     /       ",
        L"       |＼______↗|        ",
        L"   ____|          |____    "
    },
    {
        {
            L"1. 교수님이 마지막으로 본 곳이 어디죠?",
            L"어젯밤 늦게까지 본관 쪽 불이 켜져 있더군."
        },
        {
            L"2. 수상한 사람을 보셨나요?",
            L"과방에'송우진' 학생이 수상하더군 가방에 쇠지레 같은 걸 넣고 다녀"
        },
        {
            L"3. 청금석을 본 적 있나요?",
            L"일반 조형물이 아닐세. 연구 가치가 커서 탐내는 사람이 많지."
        }
    }
};
DialogueNPCData tiredStudentNpc = {
      L"복도 끝 자판기 앞",
    L"밤샘한 공대생",
    L"박보승",
    L"덕래관 수업실",
    {
        L"       _______       ",
        L"     /         \\     ",
        L"    |  o     o  |    ",
        L"    |     ^     |    ",
        L"    |   _____   |    ",
        L"     \\  \\___/  /     ",
        L"      \\_______/      ",
        L"       /|   |\\       ",
        L"      / |___| \\      ",
        L"        |   |        ",
        L"       /     \\       "
    },
    {
        {
            L"1. 어젯밤에 여기 있었나요?",
            L"네... 과제하다가 새벽 세 시까지 있었어요."
        },
        {
            L"2. 이상한 소리 못 들었어요?",
            L"본관 쪽에서 유리창이 깨지는 소리를 들었어요. 너무 놀라서 자판기 쪽으로 뛰어가다가... 아, 손을 긁혀서 피가 나네요."
        },
        {
            L"3. 혹시 누가 지나갔나요?",
            L"교수님께서 새벽 2시쯤 연구실 밖으로 나가시는 걸 봤어요. 혼잣말로 연구 어쩌고 하셨던 것 같은데...."
        }
    }
};
DialogueNPCData guardNpc = {
    L"본관 입구",
    L"경비 아저씨",
    L"경비원",
    L"본관",
    {
        L"        _________        ",
        L"      /           \\      ",
        L"     |  경  비  원 |     ",
        L"     |   o     o   |     ",
        L"     |      ㅅ      |    ",
        L"     |   \\_____/   |     ",
        L"      \\___________/      ",
        L"         /|   |\\         ",
        L"        / |___| \\        ",
        L"          |   |          ",
        L"         /     \\         "
    },
    {
        {
            L"1. 어젯밤 본관에 누굴 봤나요?",
            L"새벽 2시쯤이었나... 갑자기 눈앞이 흐려지면서 정신을 잃었소. 그전에 본관 뒤쪽에서 웬 커다란 트럭 소리를 들은 것 같기도 하고... 으음, 기억이 잘 안 나네."
        },
        {
            L"2. CCTV는 확인할 수 있나요?",
            L"하필 내가 정신을 잃은 그 시간에 전원선이 뽑혀 영상이 깨졌더군... 나, 나는 절대 경비실을 비우지 않았소! 진짜요!"
        },
        {
            L"3. 청금석 언제 마지막으로 보셨죠?",
            L"어제 저녁 순찰까지는 봤어요."
        }
    }
};
DialogueNPCData songWoojinNpc = {
    L"공대 과방 안",
    L"공대생",
    L"송우진",
    L"덕래관 과방",
    {
        L"        _________        ",
        L"      /         \\        ",
        L"     |  -     -  |       ",
        L"     |     ^     |       ",
        L"     |   _____   |       ",
        L"      \\  ___    /        ",
        L"       \\_______/         ",
        L"        /|   |\\          ",
        L"    /| / |___| \\         ",
        L"    |/   |   |           ",
        L"        /     \\          ",
        L"      _/       \\_        "
    },
    {
        {
            L"1. 어젯밤 어디에 있었어?",
            L"나? 그냥 과방에 있었는데.맞다! 새벽 2시쯤에 제갈현철 교수님이 급하게 본관 제어실 쪽으로 가시는 걸 봤어. 손에 마스터키를 쥐고 계시던데?"
        },
        {
            L"2. 지금 폰으로 뭐 보고 있는거야?",
            L"어 왜...? 이거 비밀인데??."
        },
        {
            L"3. 가방에 뭘 넣고 다닌 거야?",
            L"...그냥 공구야. 과방 컴퓨터 고치려고 가져온 거라고."
        }
    }
};