#include "DialogueNPCData.h"

DialogueNPCData professorNpc = {
    L"어두운 강의실 안",
    L"수상한 교수님",
    L"교수 제갈현철",
    L"덕래관 4층",
    {
        L"      ###############      ",
        L"    /########  ##  ###     ",
        L"   /#                #＼   ",
        L"  /#                 ##＼  ",
        L"  ##   ===       ===  ###  ",
        L" ###    ■         ■   ##|  ",
        L"  ＼|       __       |/)   ",
        L"    |    /\\__/\\     |     ",
        L"     |  {______}   /      ",
        L"      ＼   --     /       ",
        L"       |＼______↗|        ",
        L"   ____|          |____    "
    },
    {
        {
            L"1. 교수님이 마지막으로 본 곳이 어디죠?",
            L"어젯밤 늦게까지 본관 쪽 불이 켜져 있더군."
        },
        {
            L"2. 수상한 사람을 보셨나요?",
            L"~~입은 학생이 급하게 계단을 내려갔네."
        },
        {
            L"3. 청금석을 본 적 있나요?",
            L"물론이지. 그 돌 때문에 회의가 몇 번이나 열렸는데."
        }
    }
};
DialogueNPCData tiredStudentNpc = {
      L"복도 끝 자판기 앞",
    L"밤샘한 공대생",
    L"공대생",
    L"덕래관 복도",
    {
        L"       _______       ",
        L"     /         \\     ",
        L"    |  -     -  |    ",
        L"    |     ^     |    ",
        L"    |   _____   |    ",
        L"     \\  \\___/  /     ",
        L"      \\_______/      ",
        L"       /|   |\\       ",
        L"      / |___| \\      ",
        L"        |   |        ",
        L"       /     \\       "
    },
    {
        {
            L"1. 어젯밤에 여기 있었나요?",
            L"네... 과제하다가 새벽 세 시까지 있었어요."
        },
        {
            L"2. 이상한 소리 못 들었어요?",
            L"유리 깨지는 소리 같은 건 들었는데, 꿈인 줄 알았어요."
        },
        {
            L"3. 혹시 누가 지나갔나요?",
            L"누가 엄청 급하게 뛰어가긴 했어요. 신발 소리가 컸어요."
        }
    }
};
DialogueNPCData guardNpc = {
    L"본관 입구",
    L"경비 아저씨",
    L"경비원",
    L"본관",
    {
        L"        _________        ",
        L"      /           \\      ",
        L"     |  경  비  원 |     ",
        L"     |   o     o   |     ",
        L"     |      ㅅ      |    ",
        L"     |   \\_____/   |     ",
        L"      \\___________/      ",
        L"         /|   |\\         ",
        L"        / |___| \\        ",
        L"          |   |          ",
        L"         /     \\         "
    },
    {
        {
            L"1. 어젯밤 본관에 누가 들어왔나요?",
            L"명단에는 없는데, 새벽에 학생 하나가 황급히 나가긴 했지."
        },
        {
            L"2. CCTV는 확인할 수 있나요?",
            L"하필 그 시간대 영상만 깨져 있더군. 수상하지 않나?"
        },
        {
            L"3. 청금석 보관실은 어디죠?",
            L"본관 안쪽 복도 끝이다. 아무나 들어갈 수 있는 곳은 아니야."
        }
    }
};